/*Language Control*/

"__language" = "ge";


/*Standard Apple strings*/
"Your changes will be lost if you don't save them." = "Ihre Änderungen werden verworfen, falls Sie sie nicht sichern.";
"Save " = "Sichern ";
"Revert " = "Wiederherstellen ";
"Save..." = "Sichern…";
"Discard Changes" = "Änderungen verwerfen";
"The location of the document \"%@\" cannot be determined." = "Der Ort des Dokuments „%@“ konnte nicht festgestellt werden.";
"The document \"%@\" has been moved." = "Das Dokument \"%@\" wurde verschoben.";
"Quit Anyway" = "Trotzdem beenden";
"Cancel" = "Abbrechen";
"Do you want to save the changes you made in the document \"%@\"?" = "Möchten Sie die Änderungen am Dokument „%@“ sichern?";
"Don't Save" = "Nicht sichern";
"Save As..." = "Sichern unter…";



" - Canvas Size" = " - Grafikfenstergröße";

"Defaults" = "Standardwerte";

"Error" = "Fehler";

"This procedure name has already been used - please choose another" = "Dieser Prozedurname wird schon verwendet - wählen Sie einen anderen";

"New Procedure" = "Neue Prozedur";

" - Procedures" = " - Prozeduren";

"param" = "Parameter";

"Delete Procedure" = "Prozedur löschen";

"Add" = "Zufügen";

"Go Back" = "Zurück";

"Delete Procedures" = "Prozeduren löschen";

"Remove" = "Entfernen";

"This procedure name is also a function name - please choose another" = "Dieser Prozedurname ist auch ein Funktionsname - wählen Sie einen anderen";

"Parameters: " = "Parameter: ";

"Procedure: %@" = "Prozedur: %@";

"Rename Parameter" = "Parameter umbenennen";

"Export Text" = "Text exportieren";

"Save Anyway" = "Trotzdem sichern";

"Warning — Unapplied Procedures" = "Warnung — nicht übernommene Prozeduren";

/*Info Window Strings*/

"Hidden" = "Versteckt";

"Pen Down" = "Stift ab";

"Shown" = "Gezeigt";

"Pen Up" = "Stift hoch";


"Canvas Resize" = "Grafikfenstergröße";

"%@ - Graphics" = "%@ - Grafikfenster";

/*Menu show/hide*/

"Show Procedures" = "Prozedurfenster einblenden";

"Hide Procedures" = "Prozedurfenster ausblenden";

"Show Graphics" = "Grafikfenster einblenden";

"Hide Graphics" = "Grafikfenster ausblenden";

"Show Trace" = "Protokollfenster einblenden";

"Hide Trace" = "Protokollfenster ausblenden";

"Show Info" = "Infofenster einblenden";

"Hide Info" = "Infofenster ausblenden";

/*Error messages*/

	"variable %@ undefined" = "Die Variable %@ ist nicht definiert";
	"%@ is an invalid number" = "%@ ist eine ungültige Nummer";
	"unknown error" = "unbekannter Fehler";
	"unexpected object %@" = "unerwartetes Objekt %@";
	"can't %@ %@" = "Kann %@ nicht %@";
	"unterminated list" = "unbeendete Liste";
	"can't evaluate %@" = "Kann %@ nicht berechnen";
	"unknown function %@" = "Unbekannte Funktion %@";
	"%@ is invalid input for %@" = "%@ ist eine ungültige Eingabe für %@";
	"can't compare %@ and %@" = "Kann %@ nicht mit %@ vergleichen";
	"wrong number of inputs for %@" = "Falsche Anzahl von Eingaben für %@";
	"USAGE: DEFINE \"name [[params] [procedure body]]" = "Benutzung: DEFINIERE \"Name [[Parameter] [Prozedurrumpf]]";
	"unknown proc - %@" = "Unbekannte Prozedur - %@";
	"ABORTED" = "Abgebrochen";
	"%@ needs a list of two numbers" = "%@ benötigt eine Liste mit 2 Elementen";
	"%@ needs a list of three numbers" = "%@ benötigt eine Liste mit 3 Elementen";
	"SETPEN needs a list containing a pen state and a colour number" = "STIFT (SETPEN) benötigt eine Liste, die Stiftstatus und Stiftfarbe enthält";
	"unexpected end of sentence" = "Unerwartetes Ende des Satze";
	"An empty %@ is invalid input for %@" = "Ein leeres %@ ist eine ungültige Eingabe für %@";
	"%@ does not have enough items for %@ %@" = "%@ hat nicht genügend Elemente für %@ %@";
	"A file is already open for reading" = "Es ist bereits eine Datei zum Lesen geöffnet";
	"A file is already open for writing" = "Es ist bereits eine Datei zum Schreiben geöffnet";
	"File %@ doesn't exist" = "Datei %s existiert nicht";
	"File %@ is a directory" = "Datei %@ ist ein Ordner";
	"Can't open file %@ for reading" = "Kann Datei %@ nicht zum Lesen öffnen";
	"Can't open file %@ for writing" = "Kann Datei %@ nicht zum Schreiben öffnen";
	"No file is open for reading" = "Keine Datei zum Lesen geöffnet";
	"No file is open for writing" = "Keine Datei zum Schreiben geöffnet";
	"Error reading from file" = "Fehler beim Lesen aus Datei";
	"Error writing to file" = "Fehler beim Schreiben in Datei";

	"PenDown" = "StiftAb";
	"PenUp" = "StiftHoch";
	"PENDOWN" = "STIFTAB";
	"PENUP" = "STIFTHOCH";
	"integer" = "Ganzzahl";
	"double" = "reelle Zahl";
	"string" = "Zeichenkette";
	"TRUE" = "WAHR";
	"FALSE" = "FALSCH";
	"To" = "lerne";
	"procedure" = "Prozedur";
	"function" = "Funktion";
	"true" = "wahr";
	"false" = "falsch";
	"list" = "Liste";
	"variable" ="Variable";

/*Undo strings*/

"Canvas Resize" = "Größe des Zeichenbereichs ändern";
"Insert Result" = "Ergebnis einfügen";
"Rename Parameter" = "Parameter umbenennen";
"Select Turtle Image" = "Igel-Symbol auswählen";
"Add Turtle Image" = "Igel-Symbol hinzufügen";
"Change Fontface" = "Schriftart ändern";
"Edit Defaults" = "Standardwerte bearbeiten";
"Syntax Colouration" = "Syntax-Einfärbung";
"Font Size" = "Schriftgröße";
"Smooth Lines" = "Linien glätten";
"Auto Indent" = "Automatische Einrückung";
"Turtle Shadow" = "Igel-Schatten";
"Set Localisation" = "Landesspezifische Anpassung";
"Turtle Defaults" = "Igel-Voreinstellungen";
"Turtle Size" = "Igel-Größe";
"Turtle Transparency" = "Igel-Transparenz";
"Delete Image" = "Bild löschen";


